Revit 2027 API
ParameterTypeId.StairsRailingHeightShiftType Property
 "Use Landing Height Adjustment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingHeightShiftType { get; }
Public Shared ReadOnly Property StairsRailingHeightShiftType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingHeightShiftType {
	ForgeTypeId^ get ();
}
static member StairsRailingHeightShiftType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace